20200718.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1595084192</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="stormrider" />
<link href="https://fonts.googleapis.com/css2?family=Raleway&display=swap" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">1595084192</h1>
<div class="org-center">
<p>
<a href="blog.html">blog</a>  <code>~</code>   <a href="journal.html">journal</a>   <code>~</code>   <a href="doc.html">doc</a>   <code>~</code> <a href="code.html">code</a> <code>~</code> <a href="index.html">home</a>
</p>
</div>

<div id="outline-container-orgfa6c83f" class="outline-2">
<h2 id="orgfa6c83f">personal journal of stormrider</h2>
<div class="outline-text-2" id="text-orgfa6c83f">
<p>
Sat, Jul 18, 2020 / 1595084192 / 
Prickle-Prickle, Confusion 53, 3186 YOLD
</p>
</div>

<div id="outline-container-org8165218" class="outline-3">
<h3 id="org8165218">fortune -s</h3>
<div class="outline-text-3" id="text-org8165218">
<p>
You will outgrow your usefulness.  <i>heh. so will we all.</i>
</p>
</div>
</div>

<div id="outline-container-orgc325b3f" class="outline-3">
<h3 id="orgc325b3f">daily journal</h3>
<div class="outline-text-3" id="text-orgc325b3f">
</div>
<div id="outline-container-org36b01cc" class="outline-4">
<h4 id="org36b01cc"><b><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-18 Sat 09:59&gt;</span></span></b></h4>
<div class="outline-text-4" id="text-org36b01cc">
<p>
well, that was a long sleep, sort of. didn't go to bed until 11:30-ish, which is late for me, but (miracle of miracles) i slept all the way until 5am; nice; then i laid awake for a few minutes, fiddled with my phone, and then managed to go back to sleep until about 8:45.  baby, my cat, helped by snuggling, and we snoozed for hours.  no complaints; still, i got myself up and tried very hard to get started, even though my body wants to laze around.  too many things in my head that i want to do this weekend, and barely enough time to do them, in my estimation, meaning some of them won't get finished by sunday night.  that's life.
</p>
</div>
</div>

<div id="outline-container-org5d9a21c" class="outline-4">
<h4 id="org5d9a21c"><b><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-18 Sat 11:02&gt;</span></span></b></h4>
<div class="outline-text-4" id="text-org5d9a21c">
<p>
took an hour and got cleaned up, got my head on straight, took my meds %-) and generally got started on my day; it's not bad to start late on a saturday, right? anyway, had to get awake and functioning.  now let's see what i can do that's useful and enjoyable, aside from finding lunch.
</p>
</div>
</div>

<div id="outline-container-orge3b214c" class="outline-4">
<h4 id="orge3b214c"><b><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-18 Sat 11:32&gt;</span></span></b></h4>
<div class="outline-text-4" id="text-orge3b214c">
<p>
cleaned up my directories, back to a very BSD-like hierarchy for my home directory, because i basically know where to find stuff.  note to self, i've got to find a better ergo situation with desk and chair: the main pebcak is my neck, so i need better monitor position.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: stormrider</p>
<p class="date">Created: 2020-07-23 Thu 13:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
